In [ ]:
import pandas as pd

age = pd.Series([25,34,19,45,60])
print(age)  # ctrl + enter 자동실행 단축키

In [ ]:
data = ['spring','summer','fall','winter']

season = pd.Series(data)

season

In [ ]:
import pandas as pd

score = pd.Series([98,77,88,65,100,95])
score.iloc[2]  #시리즈 특정위치에 값을 추출 (i == index),2번 인덱스를 의미함.

food = pd.Series(['김밥', '떡볶이','라면','햄버거'])
print(food.iloc[2])

In [17]:
score = pd.DataFrame([[85, 96, 40, 95,],[73, 69, 45, 80],
                   [78, 50, 60, 90]],
                    columns=['국어', '수학', '영어', '과학'])

print(score)
print(score.columns)

   국어  수학  영어  과학
0  85  96  40  95
1  73  69  45  80
2  78  50  60  90
Index(['국어', '수학', '영어', '과학'], dtype='object')

In [ ]:
score.columns

In [ ]:
score = pd.Series([[85, 96, 40, 95,],
                   [73, 69, 45, 80],
                   [78, 50, 60, 90]])
                  
score.iloc[1,2]

In [38]:
import pandas as pd
score = pd.DataFrame([[85, 96, 40, 95,],
                      [73, 69, 45, 80 ],
                      [78, 50, 60, 90 ]])
score
score.index =   ['John','Jane','Tom'       ] 
score.columns = [ 'KOR','ENG', 'MATH','SCI'] 
score 

score.iloc[2,1]
score.loc['Tom','ENG']

np.int64(50)

In [40]:
score.iloc[2]

KOR     78
ENG     50
MATH    60
SCI     90
Name: Tom, dtype: int64

In [41]:
score.loc['Tom','ENG']

np.int64(50)

In [22]:
score

      KOR  ENG  MATH  SCI
John   85   96    40   95
Jane   73   69    45   80
Tom    78   50    60   90

In [23]:
score.index

Index(['John', 'Jane', 'Tom'], dtype='object')

In [24]:
score.columns

Index(['KOR', 'ENG', 'MATH', 'SCI'], dtype='object')

In [ ]:
import pandas as pd

df = pd.read_csv('ThoraricSurgery_no.csv', header=None) 
df

In [35]:
df.columns = ['A','B','C','D','E','F']

In [37]:
df

       A  B     C     D  E  F
0    293  1  3.80  2.80  0  0
1      1  2  2.88  2.16  1  0
2      8  2  3.19  2.50  1  1
3     14  2  3.98  3.06  2  1
4     17  2  2.21  1.88  0  0
..   ... ..   ...   ... .. ..
465   98  6  3.04  2.40  2  0
466  369  6  3.88  2.72  1  0
467  406  6  5.36  3.96  1  0
468   25  8  4.32  3.20  0  1
469  447  8  5.20  4.10  0  0

[470 rows x 6 columns]

In [44]:
df.iloc[:2]

     A  B     C     D  E  F
0  293  1  3.80  2.80  0  0
1    1  2  2.88  2.16  1  0

In [46]:
df.loc[:2]

     A  B     C     D  E  F
0  293  1  3.80  2.80  0  0
1    1  2  2.88  2.16  1  0
2    8  2  3.19  2.50  1  1